import {describe, test, expect} from 'vitest';
import reportMaps from "../../../../src/composables/usecases/report/reportMaps.js";

describe('transform.toClient()', () => {
    test('перетворює масив обʼєктів для клієнта', () => {
        const input = {
            unit: 1,
            date_from: '2025-12-12',
            date_to: '2025-12-15',
            report: {
                '1001': {8: [1, 1, 1], 9: [1, 1, 1], 3: [1, 2, 3], 6: [2, 3, 4]},
                '1002': {2: [1, 1, 1], 1: [1, 1, 1], 3: [1, 2, 3], 6: [2, 3, 4]},
                '1003': {2: [1, 1, 1], 1: [1, 1, 1], 3: [1, 2, 3], 6: [2, 3, 4]},
                '1004': {5: [1, 1, 1], 7: [1, 1, 1], 3: [1, 2, 3], 6: [2, 3, 4]},
                '1005': {5: [1, 1, 1], 7: [1, 1, 1], 3: [1, 2, 3], 4: [2, 3, 4]},
                '1006': {2: [1, 1, 1], 1: [1, 1, 1], 3: [1, 2, 3], 4: [2, 3, 4]},
                '1007': {2: [1, 1, 1], 1: [1, 1, 1], 3: [1, 2, 3], 4: [2, 3, 4]},
            },
        };

        const expectedOutput = {
            unit: 1,
            dateFrom: '2025-12-12',
            dateTo: '2025-12-15',
            reportData: {
                '1001': {8: [1, 1, 1], 9: [1, 1, 1], 3: [1, 2, 3], 6: [2, 3, 4]},
                '1002': {2: [1, 1, 1], 1: [1, 1, 1], 3: [1, 2, 3], 6: [2, 3, 4]},
                '1003': {2: [1, 1, 1], 1: [1, 1, 1], 3: [1, 2, 3], 6: [2, 3, 4]},
                '1004': {5: [1, 1, 1], 7: [1, 1, 1], 3: [1, 2, 3], 6: [2, 3, 4]},
                '1005': {5: [1, 1, 1], 7: [1, 1, 1], 3: [1, 2, 3], 4: [2, 3, 4]},
                '1006': {2: [1, 1, 1], 1: [1, 1, 1], 3: [1, 2, 3], 4: [2, 3, 4]},
                '1007': {2: [1, 1, 1], 1: [1, 1, 1], 3: [1, 2, 3], 4: [2, 3, 4]},
            },
        };

        expect(reportMaps.toClient(input)).toEqual(expectedOutput);
    });

    test('повертає порожній масив при пустому вхідному масиві', () => {
        const expectedOutput = {
            unit: null,
            dateFrom: null,
            dateTo: null,
            reportData: null,
        };
        expect(reportMaps.toClient([])).toEqual(expectedOutput);
    });
});
